Tekla Open API Reference for Tekla Structures 2025
ReinforcementSetGroup.ReinforcementCustomPosition Property
 Gets or sets the location of the reinforcement bar when using ReinforcementVisibility == ReinforcementVisibilityTypes.Customized. This location is a value between 0.0 and 1.0 and it defines the proportion from the reinforcement's start point.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double ReinforcementCustomPosition { get; set; }
Public Property ReinforcementCustomPosition As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ReinforcementSetGroup Class
Tekla.Structures.Drawing Namespace